InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterAddressChannel.h
/**
 *
 * @file DMA_RegisterAddressChannel.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 28 jul. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 28 jul. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERADDRESSCHANNEL_H_
#define XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERADDRESSCHANNEL_H_

#include <xDriver_MCU/DMA/Peripheral/xHeader/DMA_Enum.h>
#include <xDriver_MCU/DMA/Peripheral/Struct/xHeader/DMA_StructPeripheralChannel.h>

#define DMA_CH_MAX    (32UL)
#define DMA_CH_REG_NUM    (4UL)

extern volatile DMA_CHANNEL_t DMA__stChannel[DMA_CH_MAX * 2UL];

#define DMA_CH_PRIMARY_BASE    ((uintptr_t) (&DMA__stChannel[0UL]))
#define DMA_CH_PRIMARY_OFFSET    ((uintptr_t) DMA_CH_PRIMARY_BASE & (uint32_t) 0x00FFFFFFUL)

#define DMA_CH_ALTERNATE_BASE    ((uintptr_t) (&DMA__stChannel[DMA_CH_MAX]))
#define DMA_CH_ALTERNATE_OFFSET    ((uintptr_t) DMA_CH_ALTERNATE_BASE & (uint32_t) 0x00FFFFFFUL)

#define DMA_CH_PRIMARY_BITBANDING_BASE    ((uint32_t) 0x22000000UL)
#define DMA_CH_ALTERNATE_BITBANDING_BASE    ((uint32_t) 0x22000000UL)

#define DMA_CH0_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000000UL)
#define DMA_CH1_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000010UL)
#define DMA_CH2_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000020UL)
#define DMA_CH3_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000030UL)
#define DMA_CH4_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000040UL)
#define DMA_CH5_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000050UL)
#define DMA_CH6_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000060UL)
#define DMA_CH7_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000070UL)
#define DMA_CH8_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000080UL)
#define DMA_CH9_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000090UL)
#define DMA_CH10_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000000A0UL)
#define DMA_CH11_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000000B0UL)
#define DMA_CH12_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000000C0UL)
#define DMA_CH13_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000000D0UL)
#define DMA_CH14_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000000E0UL)
#define DMA_CH15_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000000F0UL)
#define DMA_CH16_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000100UL)
#define DMA_CH17_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000110UL)
#define DMA_CH18_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000120UL)
#define DMA_CH19_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000130UL)
#define DMA_CH20_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000140UL)
#define DMA_CH21_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000150UL)
#define DMA_CH22_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000160UL)
#define DMA_CH23_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000170UL)
#define DMA_CH24_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000180UL)
#define DMA_CH25_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x00000190UL)
#define DMA_CH26_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000001A0UL)
#define DMA_CH27_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000001B0UL)
#define DMA_CH28_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000001C0UL)
#define DMA_CH29_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000001D0UL)
#define DMA_CH30_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000001E0UL)
#define DMA_CH31_PRIMARY_BASE    ((uint32_t) DMA_CH_PRIMARY_BASE + (uint32_t) 0x000001F0UL)

#define DMA_CH0_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000000UL)
#define DMA_CH1_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000010UL)
#define DMA_CH2_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000020UL)
#define DMA_CH3_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000030UL)
#define DMA_CH4_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000040UL)
#define DMA_CH5_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000050UL)
#define DMA_CH6_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000060UL)
#define DMA_CH7_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000070UL)
#define DMA_CH8_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000080UL)
#define DMA_CH9_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000090UL)
#define DMA_CH10_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000000A0UL)
#define DMA_CH11_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000000B0UL)
#define DMA_CH12_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000000C0UL)
#define DMA_CH13_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000000D0UL)
#define DMA_CH14_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000000E0UL)
#define DMA_CH15_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000000F0UL)
#define DMA_CH16_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000100UL)
#define DMA_CH17_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000110UL)
#define DMA_CH18_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000120UL)
#define DMA_CH19_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000130UL)
#define DMA_CH20_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000140UL)
#define DMA_CH21_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000150UL)
#define DMA_CH22_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000160UL)
#define DMA_CH23_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000170UL)
#define DMA_CH24_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000180UL)
#define DMA_CH25_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x00000190UL)
#define DMA_CH26_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000001A0UL)
#define DMA_CH27_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000001B0UL)
#define DMA_CH28_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000001C0UL)
#define DMA_CH29_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000001D0UL)
#define DMA_CH30_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000001E0UL)
#define DMA_CH31_PRIMARY_OFFSET    ((uint32_t) DMA_CH_PRIMARY_OFFSET + (uint32_t) 0x000001F0UL)

#define DMA_CH0_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000000UL)
#define DMA_CH1_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000010UL)
#define DMA_CH2_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000020UL)
#define DMA_CH3_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000030UL)
#define DMA_CH4_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000040UL)
#define DMA_CH5_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000050UL)
#define DMA_CH6_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000060UL)
#define DMA_CH7_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000070UL)
#define DMA_CH8_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000080UL)
#define DMA_CH9_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000090UL)
#define DMA_CH10_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000000A0UL)
#define DMA_CH11_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000000B0UL)
#define DMA_CH12_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000000C0UL)
#define DMA_CH13_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000000D0UL)
#define DMA_CH14_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000000E0UL)
#define DMA_CH15_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000000F0UL)
#define DMA_CH16_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000100UL)
#define DMA_CH17_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000110UL)
#define DMA_CH18_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000120UL)
#define DMA_CH19_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000130UL)
#define DMA_CH20_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000140UL)
#define DMA_CH21_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000150UL)
#define DMA_CH22_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000160UL)
#define DMA_CH23_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000170UL)
#define DMA_CH24_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000180UL)
#define DMA_CH25_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x00000190UL)
#define DMA_CH26_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000001A0UL)
#define DMA_CH27_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000001B0UL)
#define DMA_CH28_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000001C0UL)
#define DMA_CH29_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000001D0UL)
#define DMA_CH30_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000001E0UL)
#define DMA_CH31_ALTERNATE_BASE    ((uint32_t) DMA_CH_ALTERNATE_BASE + (uint32_t) 0x000001F0UL)

#define DMA_CH0_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000000UL)
#define DMA_CH1_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000010UL)
#define DMA_CH2_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000020UL)
#define DMA_CH3_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000030UL)
#define DMA_CH4_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000040UL)
#define DMA_CH5_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000050UL)
#define DMA_CH6_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000060UL)
#define DMA_CH7_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000070UL)
#define DMA_CH8_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000080UL)
#define DMA_CH9_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000090UL)
#define DMA_CH10_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000000A0UL)
#define DMA_CH11_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000000B0UL)
#define DMA_CH12_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000000C0UL)
#define DMA_CH13_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000000D0UL)
#define DMA_CH14_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000000E0UL)
#define DMA_CH15_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000000F0UL)
#define DMA_CH16_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000100UL)
#define DMA_CH17_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000110UL)
#define DMA_CH18_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000120UL)
#define DMA_CH19_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000130UL)
#define DMA_CH20_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000140UL)
#define DMA_CH21_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000150UL)
#define DMA_CH22_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000160UL)
#define DMA_CH23_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000170UL)
#define DMA_CH24_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000180UL)
#define DMA_CH25_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x00000190UL)
#define DMA_CH26_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000001A0UL)
#define DMA_CH27_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000001B0UL)
#define DMA_CH28_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000001C0UL)
#define DMA_CH29_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000001D0UL)
#define DMA_CH30_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000001E0UL)
#define DMA_CH31_ALTERNATE_OFFSET    ((uint32_t) DMA_CH_ALTERNATE_OFFSET + (uint32_t) 0x000001F0UL)

#define DMA_CH_SRCENDP_OFFSET    ((uint32_t) 0x00000000UL)
#define DMA_CH_DSTENDP_OFFSET    ((uint32_t) 0x00000004UL)
#define DMA_CH_CTL_OFFSET    ((uint32_t) 0x00000008UL)
#define DMA_CH_RESERVED_OFFSET    ((uint32_t) 0x0000000CUL)

#endif /* XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERADDRESSCHANNEL_H_ */
